1m3_4mm_wall_H2_test_79/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);  

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            zeroGradient;
    }
    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    bottom_wall
    {
        type            noSlip;
    }
    top
    {
        type            zeroGradient;
    }
    nozzle_4mm_3mm_m
    {
        type            noSlip;
    }
    nozzle
    {
        // Ramp 0 → 28.9 m/s over 0.5 s (+z, upward from floor nozzle).
        // Q = 20.8 NL/min, mdot = 3.12e-5 kg/s (half = 1.56e-5 kg/s)
        // U = ṁ/(ρ·A) = 1.56e-5 / (0.08583 × π/2×(2e-3)²) ≈ 28.9 m/s
        // ρ_H2 = 0.08583 kg/m³ at T=286.15 K, P=101325 Pa (experiment conditions)
        // k auto-scales via turbulentIntensityKineticEnergyInlet (I=0.05).
        // ε auto-scales via turbulentMixingLengthDissipationRateInlet (L=2.8e-4 m).
        type            uniformFixedValue;
        uniformValue    table
        (
            (0.0    (0 0 0))
            (0.5    (0 0 28.9))
            (1000.0  (0 0 28.9))
        );
        value           uniform (0 0 0);
    }
    box_shell_m  //wall
    {
        type            noSlip;
    }
}
// ************************************************************************* //
